load-test/k6/results/test-2-for-2-min-ingestion-50-vus/insert-app_rust_axum.log

          /\      |‾‾| /‾‾/   /‾‾/
     /\  /  \     |  |/  /   /  /
    /  \/    \    |     (   /   ‾‾\ 
   /          \   |  |\  \ |  (‾)  |
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: ./scripts/insert-app.js
        output: dashboard http://127.0.0.1:5665

     scenarios: (100.00%) 1 scenario, 50 max VUs, 2m30s max duration (incl. graceful stop):
              * default: 50 looping VUs for 2m0s (gracefulStop: 30s)

     _rust_axum.....................: avg=15.154899 min=3.571  med=13.197  max=513.558  p(90)=19.642  p(95)=23.667
     data_received..................: 71 MB  593 kB/s
     data_sent......................: 75 MB  629 kB/s
     http_req_blocked...............: avg=3.9µs     min=1µs    med=3µs     max=6.85ms   p(90)=4µs     p(95)=4µs
     http_req_connecting............: avg=463ns     min=0s     med=0s      max=1.85ms   p(90)=0s      p(95)=0s
     http_req_duration..............: avg=15.21ms   min=3.6ms  med=13.25ms max=513.64ms p(90)=19.71ms p(95)=23.73ms
       { expected_response:true }...: avg=15.21ms   min=3.6ms  med=13.25ms max=513.64ms p(90)=19.71ms p(95)=23.73ms
     http_req_failed................: 0.00%  ✓ 0           ✗ 388868
     http_req_receiving.............: avg=40.97µs   min=13µs   med=34µs    max=28.44ms  p(90)=58µs    p(95)=74µs
     http_req_sending...............: avg=18.09µs   min=6µs    med=15µs    max=7.85ms   p(90)=25µs    p(95)=31µs
     http_req_tls_handshaking.......: avg=0s        min=0s     med=0s      max=0s       p(90)=0s      p(95)=0s
     http_req_waiting...............: avg=15.15ms   min=3.57ms med=13.19ms max=513.55ms p(90)=19.64ms p(95)=23.66ms
     http_reqs......................: 388868 3240.114779/s
     iteration_duration.............: avg=15.41ms   min=3.74ms med=13.44ms max=513.86ms p(90)=19.92ms p(95)=23.97ms
     iterations.....................: 388868 3240.114779/s
     vus............................: 50     min=50        max=50
     vus_max........................: 50     min=50        max=50


running (2m00.0s), 00/50 VUs, 388868 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  2m0s